{
  "main": {
    "name":"Awesome Shawn",
    "description":"With a Master of Information Technology by research from RMIT University and over 4 years of experience in the IT industry, including 1.5 years of software development experience in the real industry, and selected as 1 of 24 participants in the Australian Computer Society Victoria Technology Talent Program, I possess practical expertise in Web development and algorithms using Nodejs, Reactjs, .Net core, and Flask. Additionally, I have gained valuable experience as a DevOps Engineer on several large-scale commercial team projects, working with agile methodologies to deliver high-quality work. With excellent interpersonal skills and fluency in both English and Mandarin, I am eager to contribute my skills and knowledge to an innovative team.",
    "image":"profilepic.jpg",
    "bio":"Stay Foolish, Stay Hungry",
    "certificates":[
      {"name": "AWS Certified Solutions Architect - Associate", "url": "https://www.credly.com/badges/d80af44f-6470-4f77-ae37-66385523e288/linked_in_profile"},
      {"name": "AWS Certified Developer - Associate", "url": "https://www.credly.com/badges/6be555a7-9eff-47b8-a456-b6a28b099f02/linked_in_profile"},
      {"name": "AZ-900: Microsoft Azure Fundamentals", "url": "https://learn.microsoft.com/api/credentials/share/en-au/ShawnWang-6192/D7889145FE27658F?sharingId"}
     ],
    "contactmessage":"Contact Me By Linkedin/RED!",
    "email": "tremendous.shawn.wang@outlook.com",
    "phone": "0452298726",
    "github":"https://github.com/JadeSure",
    "myblog":"https://blog.shawnwang.space/",
    "address":{
      "street":"Georges Terrace",
      "city":"Perth",
      "state":"WA",
      "zip": "6000"
    },
    "website": "http://google.com.au",
    "resumedownload":"myCV/Shawn_CV_DevOps.pdf",
    "social":[
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/tremendous-shawn-wang/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"RED",
        "url":"https://www.xiaohongshu.com/user/profile/5c2154e70000000005037d6c",
        "className":"fa fa-book"
      },
      {
        "name":"github",
        "url":"https://github.com/JadeSure",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"High related skills in DevOps/Cloud Engineer",
    "education":[
      {
        "school":"RMIT University(Distinction Achieved)",
        "degree":"Master of Information Technology (Research Stream)",
        "graduated":"March 2021",
        "description":"Extensively covering various fields of IT, including object-oriented programming, cloud computing, algorithms, computer networks, and so on. Compared with a coursework degree, the research stream includes a three-credit project in the AI al- gorithm(Machine Learning, Deep Learning and Reinforcement Learning)-the related field with a higher quality thesis."
      },
      {
        "school": "Shanghai University of Engineering Science",
        "degree": "Bachelor of Aviation Engineering",
        "graduated": "July 2016",
        "description": "Acquired the essential skills in the mechanism engineer with a solid mathematical foundation and principle of automatic control, including VB Programming Design, Automatic Control Theory, Principles of Database, Linear Algebra, Probability Theory, and Single & Several-variable Calculus."
      }
    ],
    "work":[
      {
        "company":"Versent(Telstra Purple)",
        "title":"Cloud Engineer ",
        "years":"Jul 2023 - Until Now",
        "web_link": "https://www.linkedin.com/company/versent/",
        "description":
          ["Automated agent installation and patching (Azure ARC, Defender, SSM agent) using Bash/PowerShell scripts.",
          "Developed Python IaC automation for Palo Alto Panorama and AWS VPC (Transit Gateway, route tables) using Ansible and CloudFormation.",
          "Integrated AWS SAM, Step Functions, API Gateway, and Lambda to automate syncing Illumio data to Panorama and Palo Alto firewall configurations.",
          "Implemented GitHub Actions CI/CD pipelines to validate AWS configuration changes and sync data to S3 using OIDC for secure AWS resource access."
        ]
      },
      {
        "company":"Oli TechFin",
        "title":"Software Engineer ",
        "years":"Feb 2022 - Jan 2023",
        "description":
          ["Utilizing various AWS services to complete the different stages of product development. This included using Route53 and Amplify for frontend deployment, API Gateway and EventBridge with Lambda for backend development. Besides, I also wrapped an additional layer for a payment API to save hundreds of dollars for the company per month. Additionally, I utilized AWS SDKs for SNS, SMS, and S3.",
          "Improving the high availability of MT5(MetaTrader 5) servers, we maintained main and alterna- tive servers across cloud providers including AWS, GCP, and AliCloud. We also monitored the system’s running status using AWS CloudWatch, SNS, and Grafana.",
          "Building a data streaming pipeline for MT5 and implemented historical data crawling using Python to extract data from other competitors’ MT5 and MT4(MetaTrader 4) platforms. This helped to enrich our company’s trading database to attract customers.",
          "Developing the backend RESTful APIs using Python, Flask, Flask-Smorest, Flask-JWT-Extended, and Flask-SQLAlchemy to create a platform that enables clients to post advertisements easily through their Google Ads accounts."
        ]
      },
      {
        "company":"Freedom Lend",
        "title":"Software Engineer ",
        "years":"Nov 2021 - Feb 2022",
        "web_link": "https://www.freedomlend.com.au/",
        "description":
          ["Developing a web fill automation tool using Selenium combined with .NET WPF, which auto- matically filled data into web forms, reducing manual data entry time. The tool was highly flexible, customizable, and improving productivity and streamlining workflows.",
          "UtilizingSQL/T-SQLtogeneratereportsforservicedepartmentsbyleveragingSQLServerReporting Services (SSRS) on SQL Server as well as Postgresql databases. Insightful reports provided valuable information to our service departments, which helps to improve decision-making processes and in- crease efficiency."
        ]
      }
    ],
    "skills":[
      {
        "name":"Bash",
        "level":"95%"
      },
      {
        "name":"Python",
        "level":"95%"
      },
      {
        "name":"AWS",
        "level":"90%"
      },
      {
        "name":"Jenkins",
        "level":"80%"
      },
      {
        "name":"Terraform",
        "level":"80%"
      },
      {
        "name":"Docker",
        "level":"80%"
      },
      {
        "name":"Azure",
        "level":"50%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Sortify Inventory - SortLog",
        "tech": "Web App by Jenkins & Terraform & Docker & ECS with AWS",
        "category":"Developed a web application using Next.js and Node.js with TS that provides a straightforward inventory management system for grocery stores. This application allows real-time tracking of inventory and assets details",
        "image":"sortlog.png",
        "url":"https://drive.google.com/file/d/1bHeBQSO7o7spmuVlIi9VlpZI-iT9KaDV/view?usp=share_link"
      },
      {
        "title":"Avanger - Gamera Community",
        "tech": "Web App with CI/CD, IaC and EKS on AWS",
        "category":"The project utilizes Java Spring Boot & Reactjs, and is built using Gradle to create a com- prehensive web portal, including an online forum with a community culture that features a news section, classified information, and discussion groups for finding similar interests and hobbies.",
        "image":"gamera.png",
        "url":"https://dev.gamera.com.au/"
      },
      {
        "title":"Companet Alliance - PetLover",
        "tech": "Web with IaC Orchast in EKS&AKS and AWS&Azure",
        "category":"The goal is to create a comprehensive web portal(Nodejs & Reactjs) for Australian pet lovers to communicate experiences, share ideas and make friends. It integrated OpenAI’s Chatgpt to create a Q&A feature for users, which can answer a wide range of personalized questions.",
        "image":"PetLover.png",
        "url":"https://petslovers.com.au/"
      }
    ]
  }
}
